{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "Алина Жукова"
  },
  "text": {
    "more": "Теперь подробнее.\nУзлы - это мои друзья, они сгруппированы на основе принадлежности к тому или иному сообществу. \nПод сообществом я подразумеваю принадлежность друга к определенной сфере моей жизни (или к определенному периоду).\nВ каждом сообществе друзья связаны. Это показывают ребра, которые обозначают отношение дружбы между ними.\nУ каждого сообщества свой цвет:\nсамое маленькое (оранжевый цвет) - друзья по школе,\nфиолетовое сообщество - друзья по даче,\nзеленое и голубое - друзья по институту, причем голубое - это второкурсники, а зеленое - сокурсники.\nЗеленое и голубое сообщества плотно переплетены, тк 1 и 2 курс хорошо знают друг друга.\nКак оказалось, голубое сообщество имеет связь и с фиолетовым (два человека учились в одной школе), так и с оранжевым.\nКак познакомились Маша Барановская и Оля Коновалова - понятия не имею... Сама удивилась.\nНа графе видно, что метки узлов имеют разный размер шрифта (как и сами узлы) они отображают то, какое количество общих друзей у нас есть.\nЧем больше шрифт и узел, тем больше общих друзей у нас есть (по крайней мере в gephi это отбражалось, github отобразил по другому).\n",
    "intro": "Данный граф содержит информацию о моих друзьях в социальной сети vkontakte. ",
    "title": "Мои друзья"
  },
  "legend": {
    "edgeLabel": "дружба",
    "colorLabel": "сообщество",
    "nodeLabel": "мой друг"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": false,
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 20
    },
    "graphProperties": {
      "maxEdgeSize": 1,
      "minEdgeSize": 0.5,
      "minNodeSize": 2,
      "maxNodeSize": 10
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}
